In [1]:
import pandas as pd

In [2]:
data = {
    'a': [5,1,5,9,12,65,98,12,78,2],
    'b': [6,8,9,32,78,87,45,4,8,2],
    'c': [1,78,5,6,9,7,99,1,2,12]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

    a   b   c
0   5   6   1
1   1   8  78
2   5   9   5
3   9  32   6
4  12  78   9
5  65  87   7
6  98  45  99
7  12   4   1
8  78   8   2
9   2   2  12

In [5]:
data1 = {
    'A': [1, 5, 3],
    'B': [4, 2, 6],
    'C': [7, 9, 8]
}

In [6]:
data1

{'A': [1, 5, 3], 'B': [4, 2, 6], 'C': [7, 9, 8]}

In [7]:
df = pd.DataFrame(data1)
df

   A  B  C
0  1  4  7
1  5  2  9
2  3  6  8

In [9]:
df = pd.DataFrame(data)
df

    a   b   c
0   5   6   1
1   1   8  78
2   5   9   5
3   9  32   6
4  12  78   9
5  65  87   7
6  98  45  99
7  12   4   1
8  78   8   2
9   2   2  12

In [10]:
find_max = lambda row: max(row)

In [23]:
df['max'] = df.apply(find_max, axis=1)

In [24]:
print(df)

    a   b   c   max
0   5   6   1   6.0
1   1   8  78  78.0
2   5   9   5   9.0
3   9  32   6  32.0
4  12  78   9  78.0
5  65  87   7  87.0
6  98  45  99  99.0
7  12   4   1  12.0
8  78   8   2  78.0
9   2   2  12  12.0

In [37]:
find_sum = lambda column: sum(column)

In [40]:
df['toplam'] = df.apply(find_sum, axis=1)

In [41]:
print(df)

    a   b   c   max  toplam
0   5   6   1   6.0    80.0
1   1   8  78  78.0   815.0
2   5   9   5   9.0   130.0
3   9  32   6  32.0   385.0
4  12  78   9  78.0   875.0
5  65  87   7  87.0  1220.0
6  98  45  99  99.0  1695.0
7  12   4   1  12.0   135.0
8  78   8   2  78.0   820.0
9   2   2  12  12.0   130.0